app/controllers/dojos_controller.rb

    def index
        @dojos = Dojo.all
---
SELECT "dojos".* FROM "dojos"

    def create
        Dojo.create(branch: params[:branch], street: params[:street], city: params[:city], state: params[:state])
---
INSERT INTO "dojos" ("branch", "street", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def show
        @dojo = Dojo.find(params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]

    def edit
        @dojo = Dojo.find(params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]

    def update
        dojo = Dojo.find(params[:id])
        dojo.branch = params[:branch]
        dojo.street = params[:street]
        dojo.city = params[:city]
        dojo.state = params[:state]
        dojo.save
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "dojos" SET "branch" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "dojos"."id" = ?  [["branch", "CD New York"], ["city", "New York"], ["state", "NY"], ["updated_at", "2019-08-15 18:08:01.588396"], ["id", 1]]